Tekla.Structures.AnalysisInternal.dotADSelectedObject_t
Serialization structure for the selected analysis object

Tekla.Structures.AnalysisInternal.dotADSelectedObject_t.Id
Object ID

Tekla.Structures.AnalysisInternal.dotADSelectedObject_t.Type
Object type

Tekla.Structures.AnalysisInternal.dotADSelectedObject_t.AnalysisModelId
Analysis model ID